{"class_name": "Sequential", "keras_version": "2.1.1", "backend": "tensorflow", "config": [{"class_name": "GRU", "config": {"implementation": 1, "bias_constraint": null, "stateful": false, "units": 12, "dropout": 0.0, "batch_input_shape": [null, null, 12], "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "go_backwards": false, "kernel_constraint": null, "recurrent_regularizer": null, "trainable": true, "dtype": "float32", "return_sequences": false, "recurrent_activation": "hard_sigmoid", "recurrent_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "gru_1", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "activation": "softmax", "return_state": false, "use_bias": true, "kernel_regularizer": null, "unroll": false, "bias_regularizer": null, "activity_regularizer": null, "recurrent_dropout": 0.0}}]}