{"class_name": "Sequential", "backend": "tensorflow", "config": [{"class_name": "GRU", "config": {"recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "batch_input_shape": [null, null, 12], "recurrent_activation": "hard_sigmoid", "activity_regularizer": null, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "dropout": 0.0, "recurrent_regularizer": null, "name": "gru_1", "implementation": 1, "go_backwards": false, "use_bias": true, "bias_regularizer": null, "dtype": "float32", "recurrent_dropout": 0.0, "unroll": false, "kernel_constraint": null, "return_sequences": false, "recurrent_constraint": null, "units": 12, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "stateful": false, "activation": "softmax", "return_state": false}}], "keras_version": "2.1.1"}