{"keras_version": "2.1.1", "class_name": "Sequential", "config": [{"class_name": "GRU", "config": {"unroll": false, "dtype": "float32", "dropout": 0.0, "implementation": 1, "batch_input_shape": [null, null, 12], "recurrent_activation": "hard_sigmoid", "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "recurrent_dropout": 0.0, "trainable": true, "activation": "softmax", "name": "gru_1", "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "activity_regularizer": null, "units": 12, "bias_regularizer": null, "return_state": false, "stateful": false, "recurrent_regularizer": null, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "recurrent_constraint": null, "go_backwards": false, "return_sequences": false, "use_bias": true}}], "backend": "tensorflow"}