{"keras_version": "2.1.1", "config": [{"config": {"kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "kernel_regularizer": null, "bias_constraint": null, "activity_regularizer": null, "stateful": false, "recurrent_dropout": 0.0, "dropout": 0.0, "recurrent_regularizer": null, "use_bias": true, "go_backwards": false, "activation": "softmax", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dtype": "float32", "implementation": 1, "recurrent_activation": "hard_sigmoid", "bias_regularizer": null, "name": "gru_1", "return_sequences": false, "recurrent_constraint": null, "unroll": false, "return_state": false, "batch_input_shape": [null, null, 12], "kernel_constraint": null, "units": 12, "trainable": true}, "class_name": "GRU"}], "class_name": "Sequential", "backend": "tensorflow"}