{"backend": "tensorflow", "config": [{"config": {"activity_regularizer": null, "recurrent_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "return_state": false, "recurrent_dropout": 0.0, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "recurrent_activation": "hard_sigmoid", "activation": "softmax", "use_bias": true, "name": "gru_1", "bias_constraint": null, "return_sequences": false, "go_backwards": false, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "dropout": 0.0, "trainable": true, "units": 12, "batch_input_shape": [null, null, 12], "kernel_constraint": null, "recurrent_constraint": null, "kernel_regularizer": null, "bias_regularizer": null, "unroll": false, "dtype": "float32", "stateful": false, "implementation": 1}, "class_name": "GRU"}], "keras_version": "2.1.1", "class_name": "Sequential"}