{"keras_version": "2.1.1", "config": [{"config": {"units": 12, "return_sequences": false, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "return_state": false, "dropout": 0.0, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "activity_regularizer": null, "kernel_regularizer": null, "batch_input_shape": [null, null, 12], "name": "lstm_1", "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "stateful": false, "activation": "softmax", "dtype": "float32", "recurrent_regularizer": null, "implementation": 1, "go_backwards": false, "recurrent_dropout": 0.0, "trainable": true, "bias_regularizer": null, "recurrent_activation": "hard_sigmoid", "recurrent_constraint": null, "unroll": false, "use_bias": true, "unit_forget_bias": true}, "class_name": "LSTM"}], "backend": "tensorflow", "class_name": "Sequential"}