{"class_name": "Sequential", "config": [{"class_name": "LSTM", "config": {"batch_input_shape": [null, null, 12], "unroll": false, "dtype": "float32", "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "bias_regularizer": null, "go_backwards": false, "implementation": 1, "recurrent_regularizer": null, "unit_forget_bias": true, "activity_regularizer": null, "recurrent_dropout": 0.0, "bias_constraint": null, "name": "lstm_1", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "activation": "softmax", "return_sequences": false, "trainable": true, "recurrent_constraint": null, "recurrent_activation": "hard_sigmoid", "dropout": 0.0, "kernel_regularizer": null, "use_bias": true, "return_state": false, "stateful": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "units": 12}}], "backend": "tensorflow", "keras_version": "2.1.1"}