{"keras_version": "2.1.1", "class_name": "Sequential", "backend": "tensorflow", "config": [{"class_name": "LSTM", "config": {"units": 12, "trainable": true, "use_bias": true, "dropout": 0.0, "bias_constraint": null, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "unroll": false, "activity_regularizer": null, "recurrent_regularizer": null, "implementation": 1, "return_state": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "activation": "softmax", "stateful": false, "return_sequences": false, "go_backwards": false, "kernel_regularizer": null, "recurrent_dropout": 0.0, "name": "lstm_1", "unit_forget_bias": true, "batch_input_shape": [null, null, 12], "recurrent_activation": "hard_sigmoid", "recurrent_constraint": null, "dtype": "float32"}}]}