{"config": [{"config": {"return_state": false, "activation": "softmax", "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "use_bias": true, "unit_forget_bias": true, "kernel_constraint": null, "unroll": false, "recurrent_activation": "hard_sigmoid", "units": 12, "recurrent_constraint": null, "activity_regularizer": null, "batch_input_shape": [null, null, 12], "dtype": "float32", "bias_constraint": null, "dropout": 0.0, "return_sequences": false, "stateful": false, "trainable": true, "bias_regularizer": null, "kernel_regularizer": null, "name": "lstm_1", "recurrent_dropout": 0.0, "recurrent_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "go_backwards": false, "implementation": 1}, "class_name": "LSTM"}], "backend": "tensorflow", "keras_version": "2.1.1", "class_name": "Sequential"}