{"backend": "tensorflow", "config": [{"config": {"return_state": false, "unroll": false, "dtype": "float32", "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "recurrent_dropout": 0.0, "name": "lstm_1", "stateful": false, "bias_constraint": null, "unit_forget_bias": true, "dropout": 0.0, "batch_input_shape": [null, null, 12], "kernel_regularizer": null, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "recurrent_constraint": null, "recurrent_regularizer": null, "implementation": 1, "use_bias": true, "go_backwards": false, "recurrent_activation": "hard_sigmoid", "trainable": true, "kernel_constraint": null, "units": 12, "activation": "softmax", "return_sequences": false, "bias_regularizer": null}, "class_name": "LSTM"}], "class_name": "Sequential", "keras_version": "2.1.1"}