{"keras_version": "2.1.1", "config": [{"config": {"implementation": 1, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dtype": "float32", "unroll": false, "recurrent_regularizer": null, "return_state": false, "batch_input_shape": [null, null, 12], "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "dropout": 0.0, "recurrent_dropout": 0.0, "recurrent_constraint": null, "return_sequences": false, "use_bias": true, "name": "lstm_1", "activation": "softmax", "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "stateful": false, "recurrent_activation": "hard_sigmoid", "trainable": true, "activity_regularizer": null, "kernel_constraint": null, "bias_regularizer": null, "unit_forget_bias": true, "kernel_regularizer": null, "bias_constraint": null, "units": 12, "go_backwards": false}, "class_name": "LSTM"}], "backend": "tensorflow", "class_name": "Sequential"}