{"class_name": "Sequential", "backend": "tensorflow", "config": [{"class_name": "LSTM", "config": {"kernel_regularizer": null, "recurrent_regularizer": null, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "recurrent_dropout": 0.0, "name": "lstm_1", "go_backwards": false, "implementation": 1, "unroll": false, "units": 12, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "use_bias": true, "unit_forget_bias": true, "stateful": false, "activation": "tanh", "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "kernel_constraint": null, "bias_constraint": null, "recurrent_constraint": null, "return_sequences": true, "batch_input_shape": [null, null, 12], "recurrent_activation": "hard_sigmoid", "activity_regularizer": null, "dropout": 0.0, "bias_regularizer": null, "dtype": "float32", "return_state": false}}, {"class_name": "Layer", "config": {"name": "layer_1", "trainable": true}}, {"class_name": "LSTM", "config": {"kernel_regularizer": null, "recurrent_regularizer": null, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "recurrent_dropout": 0.0, "name": "lstm_2", "implementation": 1, "unroll": false, "units": 12, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "use_bias": true, "unit_forget_bias": true, "stateful": false, "activation": "softmax", "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "kernel_constraint": null, "bias_constraint": null, "go_backwards": false, "return_sequences": false, "recurrent_constraint": null, "recurrent_activation": "hard_sigmoid", "trainable": true, "dropout": 0.0, "bias_regularizer": null, "return_state": false}}], "keras_version": "2.1.1"}