{"class_name": "Sequential", "config": [{"class_name": "LSTM", "config": {"stateful": false, "use_bias": true, "trainable": true, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "return_sequences": false, "recurrent_regularizer": null, "kernel_regularizer": null, "dropout": 0.0, "kernel_constraint": null, "go_backwards": false, "unit_forget_bias": true, "bias_constraint": null, "recurrent_constraint": null, "activity_regularizer": null, "units": 12, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "dtype": "float32", "return_state": false, "activation": "softmax", "recurrent_dropout": 0.0, "name": "lstm_1", "batch_input_shape": [null, null, 12], "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unroll": false, "implementation": 1, "recurrent_activation": "hard_sigmoid"}}], "backend": "tensorflow", "keras_version": "2.1.1"}