{"config": [{"config": {"unroll": false, "name": "lstm_1", "batch_input_shape": [null, null, 12], "recurrent_activation": "hard_sigmoid", "activation": "softmax", "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "recurrent_dropout": 0.0, "stateful": false, "units": 12, "bias_constraint": null, "return_state": false, "recurrent_constraint": null, "kernel_constraint": null, "dtype": "float32", "return_sequences": false, "recurrent_regularizer": null, "go_backwards": false, "unit_forget_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "dropout": 0.0, "trainable": true, "kernel_regularizer": null, "implementation": 1, "use_bias": true, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}}, "class_name": "LSTM"}], "backend": "tensorflow", "class_name": "Sequential", "keras_version": "2.1.2"}