{"config": [{"config": {"kernel_regularizer": null, "recurrent_activation": "hard_sigmoid", "bias_constraint": null, "unroll": false, "stateful": false, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "recurrent_regularizer": null, "trainable": true, "recurrent_dropout": 0.0, "return_sequences": true, "name": "lstm_22", "units": 4, "dtype": "float32", "activation": "relu", "go_backwards": false, "kernel_constraint": null, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "dropout": 0.0, "bias_regularizer": null, "unit_forget_bias": true, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "return_state": false, "recurrent_constraint": null, "activity_regularizer": null, "implementation": 1, "batch_input_shape": [null, null, 12]}, "class_name": "LSTM"}, {"config": {"trainable": true, "seed": null, "name": "dropout_16", "noise_shape": null, "rate": 0.25}, "class_name": "Dropout"}, {"config": {"kernel_regularizer": null, "recurrent_activation": "hard_sigmoid", "bias_constraint": null, "unroll": false, "units": 12, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "recurrent_regularizer": null, "trainable": true, "recurrent_dropout": 0.0, "return_sequences": false, "name": "lstm_23", "stateful": false, "activation": "softmax", "go_backwards": false, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "dropout": 0.0, "bias_regularizer": null, "unit_forget_bias": true, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "return_state": false, "recurrent_constraint": null, "activity_regularizer": null, "implementation": 1, "kernel_constraint": null}, "class_name": "LSTM"}], "backend": "tensorflow", "keras_version": "2.1.2", "class_name": "Sequential"}