{"class_name": "Sequential", "keras_version": "2.1.2", "config": [{"class_name": "LSTM", "config": {"recurrent_activation": "hard_sigmoid", "return_sequences": true, "return_state": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "unroll": false, "units": 4, "go_backwards": false, "kernel_constraint": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "trainable": true, "activity_regularizer": null, "unit_forget_bias": true, "recurrent_constraint": null, "dtype": "float32", "batch_input_shape": [null, null, 12], "recurrent_regularizer": null, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "implementation": 1, "stateful": false, "name": "lstm_67", "recurrent_dropout": 0.0, "dropout": 0.0, "bias_constraint": null, "kernel_regularizer": null, "bias_regularizer": null}}, {"class_name": "Dropout", "config": {"name": "dropout_47", "seed": null, "trainable": true, "noise_shape": null, "rate": 0.25}}, {"class_name": "LSTM", "config": {"recurrent_activation": "hard_sigmoid", "return_sequences": true, "return_state": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "tanh", "unroll": false, "units": 4, "go_backwards": false, "kernel_constraint": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "trainable": true, "activity_regularizer": null, "unit_forget_bias": true, "recurrent_constraint": null, "recurrent_regularizer": null, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "implementation": 1, "stateful": false, "name": "lstm_68", "recurrent_dropout": 0.0, "dropout": 0.0, "bias_constraint": null, "kernel_regularizer": null, "bias_regularizer": null}}, {"class_name": "Dropout", "config": {"name": "dropout_48", "seed": null, "trainable": true, "noise_shape": null, "rate": 0.25}}, {"class_name": "LSTM", "config": {"recurrent_activation": "hard_sigmoid", "return_sequences": true, "return_state": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "tanh", "unroll": false, "units": 4, "go_backwards": false, "kernel_constraint": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "trainable": true, "activity_regularizer": null, "unit_forget_bias": true, "recurrent_constraint": null, "recurrent_regularizer": null, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "implementation": 1, "stateful": false, "name": "lstm_69", "recurrent_dropout": 0.0, "dropout": 0.0, "bias_constraint": null, "kernel_regularizer": null, "bias_regularizer": null}}, {"class_name": "Dropout", "config": {"name": "dropout_49", "seed": null, "trainable": true, "noise_shape": null, "rate": 0.25}}, {"class_name": "LSTM", "config": {"recurrent_activation": "hard_sigmoid", "return_sequences": false, "return_state": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "softmax", "unroll": false, "units": 12, "go_backwards": false, "kernel_constraint": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "trainable": true, "activity_regularizer": null, "unit_forget_bias": true, "recurrent_constraint": null, "recurrent_regularizer": null, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "implementation": 1, "stateful": false, "name": "lstm_70", "recurrent_dropout": 0.0, "dropout": 0.0, "bias_constraint": null, "kernel_regularizer": null, "bias_regularizer": null}}], "backend": "tensorflow"}