{"backend": "tensorflow", "config": [{"config": {"return_state": false, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "unit_forget_bias": true, "bias_regularizer": null, "recurrent_constraint": null, "dtype": "float32", "return_sequences": true, "batch_input_shape": [null, null, 12], "implementation": 1, "recurrent_activation": "hard_sigmoid", "name": "lstm_10", "recurrent_dropout": 0.0, "go_backwards": false, "units": 15, "activity_regularizer": null, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "kernel_regularizer": null, "stateful": false, "kernel_constraint": null, "bias_constraint": null, "dropout": 0.0, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "activation": "tanh", "use_bias": true, "trainable": true, "unroll": false, "recurrent_regularizer": null}, "class_name": "LSTM"}, {"config": {"name": "layer_3", "trainable": true}, "class_name": "Layer"}, {"config": {"recurrent_regularizer": null, "return_state": false, "trainable": true, "unit_forget_bias": true, "bias_regularizer": null, "recurrent_constraint": null, "recurrent_activation": "hard_sigmoid", "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "implementation": 1, "stateful": false, "recurrent_dropout": 0.0, "go_backwards": false, "return_sequences": false, "units": 12, "activity_regularizer": null, "bias_constraint": null, "kernel_regularizer": null, "name": "lstm_11", "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "activation": "softmax", "use_bias": true, "unroll": false, "dropout": 0.0}, "class_name": "LSTM"}], "keras_version": "2.1.1", "class_name": "Sequential"}